





require("tsp")


commnet={

{"赞","很赞的一款理财工具，平时喜欢在上面做点理财产品的投资，高收益，有安全保障，非常棒！",},
{"很不错的产品","觉得还行，希望一直稳定下去；新手标高达12%",},
{"推荐","操作简单，使用方便,自己一直有做投资理财，不想要什么高收益，比较看重利利金服理财。",},
{"软件不错","很好用的理财产品 收益高 安全 会一直支持",},
{"呵呵","意外发现的说这个平台很好，我也小试了一下，收益真的不错",},
{"太给力","一款高收益的理财工具，安全可靠，理财值得推荐",},
{"设计好","理财方便，简单易懂，很实用的理财产品，最近每天都在用的，希望越做越好",},
{"推荐给大家","比其他的理财产品收益要高，简单容易操作，经常还有活动免费送体验金，希望一直这么下去就好了。",},
{"不错","活期和定期搭配，产品期限长期和短期结合。",},
{"理财帮手"," 里面有许多理财产品，投资收益高，安全可靠，值得推荐。",},

}

key = 10
inputText(commnet[key][1])
click(106,441)
inputText(commnet[key][2])

