require("tsp")
init(1)
if not(t)then
    t={}
end




degree = 90
t['奖励-有奖励'] = { 0xe0ac64,"6|-9|0xfef6a4,34|-41|0xe30000",degree,8,119,109,221}
t['奖励-奖励面板-领取'] = { 0xbf0f,"-58|-16|0xd40f,57|15|0x9e0d",degree,954,173,1137,657}
t['奖励-奖励面板-领取分类'] = { 0x1e6184,"-32|-31|0xe20000",degree,31,112,157,525}
t['奖励-奖励面板-红色-银'] = { 0xc2c4d4,"37|-36|0xe20000",degree,606,155,717,249}
t['奖励-奖励面板-红色-黄'] = { 0xf4b246,"37|-35|0xe20000",degree,1013,148,1166,258}
t['奖励-奖励面板-领取箱子'] = { 0xffff19,"-26|2|0xfec404",degree,292,132,1160,278}


if d("奖励-有奖励",true,1,3) or d('奖励-奖励面板-领取') then

	while ( d("奖励-奖励面板-领取",true,1,2) or d("奖励-奖励面板-红色-银",true,1,2)or d("奖励-奖励面板-红色-黄",true,1,2)or d("奖励-奖励面板-领取箱子",true) or d("奖励-奖励面板-领取分类",true,1,2) ) do

    end
end
































