require("tsp")
init(1)

if not(t)then
    t={}
end

t['车']={0x005cb3, "0|0|0x005cb3,-30|11|0xffbd79",90,977,184,1332,345}
t['造车']={0x006a9d, "0|0|0x006a9d,-157|9|0x20aa10,-311|-16|0x0c83bd",90,752,167,1333,512}
t['训练']={0x00c2fe, "0|0|0x00c2fe,-54|-8|0x1176bc,-314|7|0xffab00",90,581,532,1148,674}
t['加速']={0xdfa30f, "0|0|0xdfa30f,144|-13|0x00699b,-137|-26|0x077bb2",90,664,164,1330,526}
    t['加速-使用']={0x1274ba, "0|0|0x1274ba,-88|-20|0x00cffd,52|23|0x00aeeb",90,718,323,1169,465}
    t['加速-使用-X']={0x1274ba, "0|0|0x1274ba,-20|-5|0x00c3ff,-54|-9|0xe1ebef",90,716,182,1164,464}
    t['加速-使用-TOP']={0x1274ba, "0|0|0x1274ba,-46|-7|0x00c8ff,-13|-23|0x00d0f9",90,721,192,1156,332}


for i = 0,20 do
    if not(d('车',true,1,2)) then
        click(1089, 274)
    end
    if not(d('车',true,1,2)) then
        click(1089, 274)
    end
    if d('造车',true,1,2) then
        d('训练',true,1,2)
    end
    d('车',true,1,2)
    d('加速',true,1,2)
    d('加速-使用',1,2)
    d('加速-使用-X',1,2)
    d('加速-使用-TOP',1,2)
    d('加速-使用-X',1,2)
    d('加速-使用-TOP',1,2)
end








































