
-------------------------------------------在图下的合集-----------------
t['在地图界面_商店_领地_地图_任务']={ 0x9d5500, "-908|640|0x3e5dad,-1037|645|0x917444,-1153|654|0xdbff25", 90, 0, 0, 1333, 749 } --多点找色
	t['在地图界面_声望奖励提示']={ 0xf4d765, "40|-4|0xca0e10,55|-19|0xcf2c20", 90, 111, 94, 198, 160 } --多点找色
-----------------------------------------返回下的界面-----------------
t['返回']={ 0xf4f491, "24|-17|0x2d6477,41|1|0x257370,28|9|0xb2c3c3,16|21|0x3c9871,-25|3|0x307b78", 90, 1, 1, 98, 63 } --返回图标
	t['返回_设置界面']={ 0x2e5d17, "-3|-106|0x2d5f19,165|-107|0x4d8d27,168|-2|0x458626", 90, 1088, 80, 1304, 634 } --特征找到2个未激活的绿色按钮
	t['返回_商城界面']={ 0xfdffff, "214|-7|0xe7e77b,438|-5|0x00bd99", 90, 638, 8, 1277, 76 } --特征是右上方3种资源图标不变
		t['返回_商城界面_宝箱翻页']={ 0xa19a6e, "-18|-32|0xe7e79c,-6|-63|0xd02e20", 90, 987, 360, 1057, 508 } --有点红点
		t['返回_商城界面_宝箱页面']={ 0xc01c2d, "-307|-556|0xd90043,171|-556|0xd90043,-90|-540|0xffe200", 90, 260, 60, 955, 736 } --多点找色
		t['返回_商城界面_商城']={ 0xffffff, "6|-18|0x6e3e1d,16|-35|0xd0c386,-34|2|0xccbf81", 90, 45, 75, 143, 168 } --多点找色
		t['返回_商城界面_会员翻页']={ 0x958d69, "-19|-43|0xcdcd93,-21|32|0x727a78,8|-11|0xab0639,8|-26|0xed490e", 90, 989, 282, 1061, 404 } --多点找色
		t['返回_商城界面_补给红点']={ 0x5a9627, "26|-21|0xa8063f,24|-36|0xe9440e,34|-30|0xcb2b22", 90, 1231, 599, 1298, 700 } --多点找色
	t['返回_城堡中']={ 0xeeee90, "0|6|0x0f323e,-11|19|0xb5a87a,8|19|0xacb8ad", 90, 97, 7, 155, 65 } --多点找色
		t['返回_城堡中_右下角对话按钮']={ 0x154a51, "8|0|0xedeb8c,15|0|0x11474f,21|-12|0xf4f391", 90, 1242, 666, 1317, 738 } --多点找色
	t['返回_深渊界面']={ 0xd96f09, "303|-635|0xff0000,509|-644|0x33f4ff", 90, 394, 7, 1222, 745 } --下一关, 为扩展准备的
	t['返回_邮件界面']={ 0xdfffe5, "-761|658|0x93d9d9,-761|656|0x289b96,233|419|0xdcebea", 90, 12, 37, 1321, 742 } --多点找色
	t['返回_任务界面']={ 0x487222, "90|-36|0x4a7b29,190|-1|0x2e692a,88|31|0x4a7b29", 90, 1077, 78, 1312, 417 } --多点找色
		t['返回_任务界面_活跃激活']={ 0xfff281, "2|3|0xffe44f,1050|-13|0xb9e719", 90, 15, 208, 1322, 311 } --多点找色
		t['返回_任务界面_伙伴']={ 0x2c6119, "-1|14|0x2c6319,-60|3|0x21eeff", 90, 1010, 406, 1267, 522 } --多点找色
	t['返回_世界地图界面']={ 0x154a52, "6|0|0xedeb8f,6|-15|0xdee092,16|21|0xaa9d80", 90, 1240, 669, 1314, 734 } --右下角的对话框
	t['返回_公会界面']={ 0x2d6018, "2|96|0x2c5e17,4|202|0x2a6218,175|11|0x498926", 90, 1041, 77, 1295, 731 } --多点找色
	t['返回_宝库界面']={ 0xedec9e, "-76|31|0xadae7f,-21|-12|0xdbdb99", 90, 574, 41, 1253, 157 } --多点找色
		t['返回_宝库界面_宝箱激活']={ 0xffff91, "0|-8|0xffff91", 90, 746, 72, 807, 126 } --多点找色
	
	t['返回_活动中心_报名活动']={ 0x49c540, "84|-37|0xc62827,373|-516|0xf9e2af", 90, 328, 130, 1011, 695}
	
	--tips--
	t['返回_城防内容tips']={ 0xfefefe, "-126|-10|0x2998ba,-210|-47|0xedfd9b,71|39|0xd2f569,43|29|0x1fbbc5", 90, 68, 600, 388, 726}
-----------------------------------------战斗界面下的东西----------------
t['战斗界面_预设未展开']={ 0xfdfdfd, "25|0|0xfafbfb,12|21|0x48bf8b,12|23|0xd1fcea", 90, 1122, 63, 1169, 113 } --多点找色
t['战斗界面_预设已展开']={ 0x369170, "17|2|0xffffff,31|-3|0x359071,16|-5|0x1c4d3d", 90, 1122, 63, 1169, 113 } --多点找色
	t['战斗界面_可以开战']={ 0x2aac59, "4|54|0xbef031,55|-8|0x0d995a", 90, 1169, 598, 1311, 729 } --多点找色

t['弹窗_城堡内_资源列表']={ 0x74f0f7, "61|-123|0xf4d765", 90, 431, 101, 802, 353 } --多点找色
t['弹窗_城堡内_科技完成']={ 0x45c446, "-106|-300|0xf4d765,100|2|0x2eb53e", 90, 485, 187, 825, 547 } --多点找色
t['弹窗_宝箱领取']={ 0x83eb42, "341|-500|0x861400,-352|-502|0x861400", 90, 246, 41, 1106, 648 } --多点找色
t['弹窗_双蓝按钮_右左']={ 0x28abbe, "-341|-4|0x27a5bd,124|-48|0x49acca,22|35|0xd6fff9,-485|-18|0x8bd7ec", 90, 313, 392, 1008, 534 } --
t['弹窗_魔像弹窗']={ 0xde8e3d, "-298|14|0x7eeb40,-300|-500|0xcd2b07", 90, 473, 71, 1159, 681 } --多点找色
t['弹窗_魔镜借兵']={ 0x8ef043, "-118|-568|0x00b053,152|-562|0xebe891", 90, 126, 73, 1238, 700 } --弹窗_魔镜借兵
t['弹窗_公会技能']={ 0x47c642, "-56|33|0x5ed84d,73|-24|0x18894c", 90, 592, 652, 745, 730 } --多点找色

t['弹窗_报名活动_选择参赛时间']={  0xf6971d, "-17|133|0x919f2a,0|271|0x34c996", 90, 525, 227, 667, 581}

t['结算界面_战斗胜利']={ 0x5dda3d, "-410|-11|0x27a2bd,347|-21|0xf2f293", 90, 311, 638, 1255, 731}

	t['任务下_墨镜']={ 0xa1af91, "-1|27|0xa0ac8e,-659|-61|0xeff7fb,-692|-66|0x249aca,-436|-34|0x206c90", 90, 88, 94, 1014, 718 } --多点找色
	t['任务下_水晶']={ 0x9eac8f, "-1|27|0xa0ac8e,-647|23|0x1f3038,-640|0|0x62c7ca,-508|13|0x6040e1,-363|17|0x173852", 90, 88, 94, 1014, 718 } --多点找色
	t['任务下_木']={ 0xa3b1a1, "-2|29|0xa0ad8e,-651|26|0xa9b9ca,-640|2|0x57c6c6,-507|16|0xc09461,-363|19|0x183851", 90, 88, 94, 1014, 718 } --多点找色
	t['任务下_血钻']={ 0x9cab8a, "-2|26|0xa0ad8e,-646|21|0x25343c,-641|-4|0x2173a7,-509|17|0xbd101b,-372|15|0x183851", 90, 88, 94, 1014, 718 } --多点找色
	t['任务下_金']={ 0xa1ae9c, "-1|28|0xa0ac8e,-648|24|0x203037,-640|0|0x4abfc4,-506|17|0xab7e29,-361|19|0x153b54", 90, 88, 94, 1014, 718 } --多点找色
	t['任务下_秘银']={ 0x9fae93, "0|27|0xa2ae90,-646|25|0x1a2b34,-638|0|0x4fc0c3,-505|20|0x65fbdb,-368|14|0x183a4f", 90, 88, 94, 1014, 718 } --多点找色
	t['任务下_水']={ 0xa3b1a3, "-1|28|0xa2ae90,-647|25|0x233337,-640|0|0x43d3cd,-504|29|0x3fd6eb,-364|18|0x173850", 90, 88, 94, 1014, 718 } --多点找色
	t['任务下_魔镜']={{908,344,0xa2b099},{908,371,0xa2ae90},{231,278,0x2498c7},{286,315,0x259dcb},{255,351,0x133048},{399,352,0x16354d},{600,358,0x173a4f},}  --多点取色
-------------------------------------------------------以下的旧的取色
aoc['在地图中']={}
	aoc['在地图中']['在地图界面']={{1214,28,0xa05900},{311,672,0x3c5fad},{182,677,0x917546},{68,684,0xdbff25},} --多点比色
	--1商城,2领地,3地图,4任务
		aoc['在地图中']['发现矿点']={ 0x07b6ff, "0|-12|0x0f86d0,0|-19|0x07abff", 80, 422, 70, 989, 700}
		aoc['在地图中']['矿点顶部']={ 0x12f0ff, "0|3|0x0db9ff", 80, 384, 70, 968, 272}
		aoc['在地图中']['挡住矿的提示']={ 0xffffff, "2|-2|0x1d2828,-129|-15|0xada070,161|-23|0xad9f6d", 90, 217, 83, 1187, 635}
		aoc['在地图中']['活动奖励']={ 0xf9dd96, "9|0|0xd02d21,11|12|0xfce099", 90, 60, 158, 225, 191}
		aoc['在地图中']['活动星星']={ 0xe8e68e, "-11|-26|0x154d55,-30|-29|0xf2f293,-39|-41|0x11575c", 90, 4, 161, 227, 254}
		aoc['在地图中']['城市奖励']={ 0xf3f191, "29|-20|0xcf2a21", 90, 1039, 628, 1117, 711}
		aoc['在地图中']['声望奖励']={{145,121,0xf4d765}, {176,113,0xc72427}, }
		aoc['在地图中']['战争结束']={{1182,131,0xffffff},{1180,128,0x9f0d06},{1175,128,0xffffff},}

aoc['返回']={}
	aoc['返回']['返回图标']={{37,29,0xf1f093}, }
		aoc['返回']['任务界面']={ 0xbbe718, "8|104|0x2d611c", 90, 1094, 108, 1292, 290 } --多点找色
			aoc['返回']['感叹号']={ 0x42ffce, "6|-23|0x39fbca,13|-64|0x00ffdb", 90, 113, 103, 195, 713}
			aoc['返回']['任务蓝色']={ 0x22ffd3, "", 90, 108, 560, 206, 711}
			
			aoc['返回']['有任务下的红点']={ 0x528f26, "45|-33|0xd22e1e", 90, 1077, 206, 1312, 420}
			
			--活跃界面
			aoc['返回']['活跃界面']={{94,265,0xfff375}}
				aoc['返回']['活跃点击']={ 0xffffff, "-2|0|0x548e5b,6|0|0x8df144", 90, 111, 572, 1009, 654}
				aoc['返回']['活跃领取']={ 0xd3311e, "-24|23|0xfde12f", 90, 80, 134, 1011, 275}
				aoc['返回']['活跃领取-银宝箱']={ 0xd32d21, "-4|0|0xfeeca3", 90, 80, 136, 1014, 288}
			aoc['返回']['签到界面']={{375,125,0xa91e05}, {401,125,0xa91e05}, }
				aoc['返回']['可以签到']={ 0x90f145, "-55|-21|0x46b554,53|-33|0x1d904c", 90, 105, 626, 1000, 712}
				aoc['返回']['可领龙币']={ 0xd3b862, "16|-13|0xcc2922", 90, 377, 154, 994, 214}
				aoc['返回']['可领龙币_钱袋']={ 0xfcfa8f, "29|-31|0xcc2822", 90, 1031, 580, 1152, 686}
				
		aoc['返回']['在世界地图上']={{1274,689,0xe2df8c}, {1277,686,0x10363b}, }
			aoc['返回']['前往']={ 0xffffff, "-30|2|0xffffff,-64|-23|0x42ad74,34|17|0x43d553,30|-23|0x118961", 90, 1, 75, 1332, 747 } --多点找色
			aoc['返回']['在城堡中']={{124,15,0xf4f190},{124,21,0x102e3b},}
		aoc['返回']['邮件界面']={{197,26,0x111820}, {198,22,0xffffff}, {197,21,0x1e242b}, {204,21,0x22282e}, {204,22,0xffffff}, }
			aoc['返回']['邮件界面_一键']={ 0x3ec4b9, "-5|-19|0x114e5d,3|-32|0x208bb1", 90, 867, 639, 1285, 700 }
			
		aoc['返回']['宝箱界面']={{200,25,0x2c2725}, {200,27,0xffffff}, {200,30,0x110b07}, }
		aoc['返回']['商城界面']={{1131,25,0x00be9f}, {910,22,0xedea7c}, }
			aoc['返回']['商城']={{194,28,0x201a18}, {191,28,0xffffff}, {187,28,0x120a08}, }
				aoc['返回']['金币可以购买1']={ 0xdabe51, "-11|2|0xac852c,-7|5|0xe7dd6b,-5|8|0xd49628,4|3|0xe5dd6d,-4|7|0xd3ad42", 90, 320, 372, 1052, 394 } --多点找色
				aoc['返回']['金币可以购买2']={ 0xbb8927, "-12|-5|0xe4e170,-6|-5|0xe9e174,3|-6|0xc9a244,-3|-4|0xe8e36e", 90, 338, 652, 1043, 667 } --多点找色
				aoc['返回']['3折稀有']={ 0xe78a10, "-11|0|0xfad955,-75|-17|0xb88130,-1|157|0xad5a10,-54|204|0xf7f6f6", 90, 345, 438, 1047, 710}
				aoc['返回']['最右端']={ 0xb2fdfd, "3|7|0x447fa0,-268|27|0xc8a77f,-456|-10|0xffffa5", 90, 369, 180, 1036, 397}
		aoc['返回']['设置']={{210,18,0x0b131d}, {208,18,0xfcfcfc}, }
	
			aoc['返回']['宝箱红点']={ 0x5a9828, "23|-27|0xd6331d", 90, 1151, 201, 1308, 603}
				aoc['返回']['宝箱翻页']={{1034,431,0xb8b280}, {1032,375,0xd32f1e}, }
				aoc['返回']['免费宝箱']={ 0xfeffff, "44|3|0xffffff", 90, 491, 592, 613, 647}
			aoc['返回']['礼包红点']={ 0xcc0424, "2|-20|0xcc0424,10|-25|0xfffe5c", 90, 1098, 52, 1319, 741}
				aoc['返回']['奖励确定']={ 0x29aabe, "-153|-10|0x2c8ab6,153|-6|0x106fa9,-4|-49|0x1f93bd,-5|33|0x50d2ad", 90, 244, 167, 634, 717}
				aoc['返回']['有邮件在']={ 0x1d3d40, "68|35|0x1f3c3f,167|10|0x1c3b3f,345|19|0x142a3b", 90, 852, 94, 1294, 194}
				aoc['返回']['邮件可以删除']={ 0xd7d1de, "0|3|0x383e5f,0|15|0x77426f", 90, 1145, 96, 1301, 722}
				aoc['返回']['邮件不能删除']={ 0x94b4d2, "1|3|0x283038,13|-8|0x2e3841,16|-8|0x95b6d4", 90, 1178, 95, 1296, 276}
				
		aoc['返回']['爵位界面']={ 0xb3141a, "168|-4|0xbb151d", 90, 820, 180, 1112, 493}
			aoc['返回']['晋升']={ 0x62dd3c, "7|-4|0x2a6a1e", 90, 1015, 603, 1192, 672}	
		aoc['返回']['英雄']={{163,24,0xffffff},{163,26,0x101620},{163,27,0xffffff},{164,35,0x111921},{166,39,0xffffff},}		
			aoc['返回']['英雄红点']={ 0xd8341d, "0|-10|0xf8d389,-12|2|0xfbdf98,12|2|0xfcea9f", 90, 272, 101, 1087, 158}
			aoc['返回']['英雄界面']={{478,184,0x109b31},{477,170,0xf5eea5},{498,169,0xc2a55e},}
				aoc['返回']['英雄装备']={ 0x2db050, "-5|4|0x3cb84b", 70, 436, 337, 839, 664}
				aoc['返回']['英雄穿戴']={ 0x114f5f, "-2|0|0x249cbc,-13|0|0x124f5e", 90, 972, 196, 1090, 653}
				aoc['返回']['天赋']={{1145,391,0x193610},{1233,364,0xdf3c16},}
				aoc['返回']['天赋学习']={ 0xcc0b00, "3|6|0xffffff,7|12|0xcf1600,22|19|0x229aba", 90, 824, 235, 909, 673}
				aoc['返回']['有装备可穿']={{1167,179,0x427d25},{1234,157,0xd63220},}
				aoc['返回']['英雄未获得']={ 0xfefecd, "", 90, 1024, 99, 1273, 167}
				aoc['返回']['英雄展开']={{300,136,0xaf924c},{300,139,0xfefecd},}
				aoc['返回']['有新装备提示界面']={{1232,157,0xd4321d},{1189,190,0xb6e71b},{1079,194,0xb7e71a},}
				
		aoc['返回']['医院']={{1049,590,0xf1ab35},{669,115,0xf4fff6},}
		aoc['返回']['挑战赛界面']={{679,85,0xcb2c0a},}
		aoc['返回']['活动中心界面']={ 0xf6f6f6, "165|15|0xeeecd5,-199|14|0xeee8db", 90, 392, 1, 1023, 107}
			aoc['返回']['可以领奖']={ 0x45bf3d, "-7|-1|0xffffff,-5|-18|0x39ad4e", 90, 746, 282, 1002, 726 } --多点找色
			aoc['返回']['活动右侧例表']={ 0xcb2924, "-11|0|0xfadd8f", 90, 1236, 71, 1301, 692}
			aoc['返回']['跨服公会战']={ 0x9bf349, "-582|-5|0x8aec43", 90, 148, 574, 942, 692}
			aoc['返回']['活动中心可以抽奖']={{356,513,0xffff7c},{491,464,0xd4311c},}
		
		aoc['返回']['宝库界面']={{187,23,0x0f1620}, {185,23,0xf4f4f4}, {181,19,0xffffff}, {164,23,0x0a131c}, }
			aoc['返回']['宝库界面_宝箱']={{756,91,0xffff91}, {772,92,0x5f8769}, {780,89,0xffff91}, }
			
		aoc['返回']['公会界面']={{193,31,0x0a121c}, {193,28,0xffffff}, {191,25,0x0c141e}, {188,24,0xffffff}, }
			
			aoc['返回']['公会奖励红点']={ 0x4a8525, "53|-27|0xcf2b20", 90, 1109, 101, 1298, 754}
			aoc['返回']['赠品界面']={{1202,560,0xcaf010},{1252,529,0xce2a21},}
				aoc['返回']['赠品领取']={ 0x56d242, "-37|-20|0x43ae72,100|12|0x5ee451,109|-16|0x14874b", 90, 100, 152, 1056, 467}
			aoc['返回']['城市界面']={ 0xd90042, "-461|1|0xda0042", 90, 171, 96, 740, 157}
				aoc['返回']['全部领取']={ 0x82eb42, "1|-11|0x2d6f1f,-5|-11|0xffffff", 90, 843, 114, 1019, 168}
				aoc['返回']['全部领取灰']={ 0x6b8297, "59|-6|0xffffff,69|-18|0x62778b,71|15|0x8faeca", 90, 838, 114, 1018, 169}
				aoc['返回']['城市奖励领取']={ 0xf5f99a, "-67|-1|0xffffff,-138|0|0xe1f777,-145|-1|0x73ef0b", 90, 108, 392, 1031, 565}
			
		aoc['返回']['服务器界面']={{1246,252,0xb2e31b},{1174,255,0xffffff},{1113,251,0xace01f},}
			aoc['返回']['服务器例表未展开']={{185,298,0xffffff},{185,297,0x1e4c5e},{179,307,0x44a7c2},}
			aoc['返回']['服务器例表展开']={{189,305,0xffffff},{189,308,0x285a65},{190,311,0x4bb2c8},}
			
		aoc['返回']['魔镜中']={{38,120,0xf1f2f1},{39,117,0x0c2822},{39,101,0xfbfcfb},}
			aoc['返回']['自动前进']={{57,687,0xa5ff3b},{78,681,0xa5ff3b},{71,648,0xa5ff3b},}
			aoc['返回']['魔镜遇怪']={ 0xcd2b22, "0|12|0xffdf9b", 90, 0, 262, 41, 302}
			
			--------------------深渊设置-----------------------------------------------------------------------------------
		aoc['返回']['城堡中_深渊']={ 0xe4e198, "-61|-11|0x144e55,8|-42|0xd3321c,-43|-33|0xddcd53", 90, 131, 621, 513, 748 }
		aoc['返回']['返回_深渊界面_返回_龙巢_地图']={ 0xf0f093, "20|617|0xf1f193,1246|616|0xf3f293,1249|609|0x153d50", 90, 1, 1, 1332, 748}
			aoc['返回']['返回_深渊界面_英雄宝箱']={ 0xb6730c, "-3|-12|0xfffff8,-13|-4|0xf9e67d,12|-4|0xf8e57a", 90, 105, 43, 1247, 587}
			t['返回_深渊界面_上阵英雄']={ 0x1f283f, "-1|24|0x20233a,24|24|0x20233b,23|-1|0x202840,-8|-31|0x61486f,11|49|0x814c6b", 90, 76, 98, 1265, 578 } --多点找色
		----------------------开龙设置----------------------------------------------
		t['返回_城堡中_龙巢']={ 0xc5ad8c, "-18|-38|0xed603c,4|-80|0xdf4a30,5|-65|0xde5646", 90, 1180, 459, 1301, 590 } --多点找色
		t['返回_龙巢界面']={ 0x35393f, "1|27|0xc4c4c4,55|29|0x727477,148|1|0x282d34,148|30|0xc6c7c7", 90, 133, 11, 303, 56 } --多点找色
			t['返回_龙巢界面_新手界面']={ 0xb9e719, "23|105|0x103555,35|224|0x0d2c4e,49|355|0x0a2649", 90, 1013, 124, 1248, 635 } --多点找色
			t['返回_龙巢界面_新手界面_点击孵化']={ 0xffffff, "-100|-21|0x2d97bc,58|16|0x299cc1", 90, 460, 442, 699, 543 } --多点找色
			t['返回_龙巢界面_新手界面_抚养']={ 0x2aa9c1, "-58|-15|0x2e91b5,78|16|0x2aa7c3,305|-3|0x1878ab", 90, 344, 447, 860, 541 } --多点找色
			t['返回_龙巢界面_喂养多次']={ 0x187dab, "-136|-23|0x318eb1,25|30|0x2995bc", 90, 588, 588, 821, 702 } --多点找色
			t['返回_龙巢界面_喂养']={ 0x2194b6, "-102|-30|0x3094b9,49|26|0x2998bc", 90, 583, 581, 1084, 713 } --多点找色
			t['返回_龙巢界面_进阶']={ 0x41cb39, "-125|-30|0x46aa5f,20|11|0x47d237", 90, 792, 576, 1059, 723 } --多点找色
			t['返回_龙巢界面_天赋升级']={ 0xffffff, "-89|-43|0x318eb7,53|9|0x289bbc", 90, 789, 308, 1024, 715, } --多点找色
			t['返回_龙巢界面_红点']={ 0xca2623, "-7|-9|0xfe4c06,-2|6|0xae0e36", 90, 1203, 135, 1246, 549 } --多点找色
			
		-------------龙牙大陆-------------	
		t['龙牙大陆选国界面']={ 0x2b9ac0, "-204|-53|0x2f93b4", 90, 883, 600, 1213, 713 } --多点找色
			t['龙牙国家位置']={{340,569,0x8f7444},{660,392,0x6f583b},{548,211,0x87663d},{584,508,0x775233},{305,228,0x886843},{236,433,0x7d5a33},}  --多点取色
				--1:深蓝(桑多瑞),2:橙色(葛雷),3:蓝色(利萨姆),4:黄色(达姆斯),5:紫色(莉维塔),6:绿色(夏亚)
			t['龙牙大陆选国界面_进入']={ 0x2b9fbf, "-179|-48|0x2d93b4", 90, 922, 577, 1181, 718 } --多点找色
				
				
				
				
aoc['car'] = {}
	aoc['car']['人物定位']={ 0xe7e4eb, 
		"-11|0|0x373d5e,12|0|0x373d5e,18|0|0xffffff,-16|0|0xffffff", 90, 111, 4, 1223, 743}
	aoc['car']['误点城堡']={{847,39,0xe8e0c7},{488,39,0xe9e1c8},}
	aoc['car']['有车']={ 0xeb0000, "0|-4|0xfb0000", 90, 103, 21, 1221, 714}
		aoc['car']['前往']={ 0x52d23d, "2|0|0x28691e,-7|0|0xffffff", 90, 315, 44, 1183, 729}
		aoc['car']['点车子']={
			{ 0x63ddf5, "", 90, 449, 60, 890, 232},
			{ 0x63ddf5, "", 90, 759, 166, 1061, 610},
			{ 0x63ddf5, "", 90, 436, 313, 995, 605},
			{ 0x63ddf5, "", 90, 346, 121, 571, 562},
			}
aoc['car']['正在跑路']={ 0x9becf0, "26|-1|0x99f3fb,14|9|0x99f1f7", 90, 220, 111, 1118, 720}
aoc['car']['拦截']={{1176,511,0xffffff},{1316,486,0xef404d},{1071,515,0xf0edf3},}
aoc['car']['无体力劫车']={{1070,513,0xf2f1f2},{1070,507,0x333c4a},{1154,517,0x62778b},{1298,475,0x526474},}
	aoc['car']['展开']={ 0x21ae95, "-6|0|0x49d0b7", 90, 2, 354, 19, 388}
	aoc['car']['技能']={ 0x13130e, "3|-8|0xf3f38e", 90, 32, 392, 128, 433}
	aoc['car']['回城']={ 0xeefff3, "-35|-1|0xc3a155,72|-4|0xb7985f", 90, 212, 161, 391, 354}
	aoc['car']['使用']={ 0x114d5c, "-2|0|0x2193b1,3|0|0xffffff", 90, 930, 482, 1049, 544}
	aoc['car']['封号']={{696,471,0x44c83c},{693,471,0x23661f},{666,476,0x2a6a1e},{662,476,0x55d43d},}
	
aoc['换服']={}
	aoc['换服']['在地图上']={ 0xdcff28, "125|-5|0xf9eba5,1154|-650|0x974f00", 90, 0, 0, 1333, 749 } --多点找色
		aoc['换服']['帐号管理']={{1180,257,0x2d6720},{1183,257,0x173310},{1185,257,0x9eba94},}
		aoc['换服']['设置功能选择']={{283,275,0x29a0bd},{780,277,0x2aa5c0},{782,558,0x29a5c1},}
			--选服,绑定,礼包
		aoc['换服']['聊天按钮']={ 0x13474f, "8|-1|0xedeb92,14|-1|0x114549,22|0|0xd3c781", 90, 0, 0, 1333, 749}
		
		
		
	aoc['换服']['礼包兑换']={{633,413,0x29acbe},{644,180,0xffffff},{640,179,0x0e1d28},}
		aoc['换服']['输入完成']={ 0x007aff, "-26|-3|0x007aff,-19|15|0x007aff", 90, 1, 364, 1321, 735}
	aoc['换服']['兑换成功']={{676,584,0x14545e},{674,584,0xfdfdfd},{666,584,0x14545f},{661,584,0x29a8bd},}

	aoc['换服']['个人主页']={{1172,142,0xcbef0f},{1128,253,0x2d5e18},{1129,361,0x2d611a},{1110,463,0x2c6318},} -- 2,3
	aoc['换服']['设置界面']={{1131,463,0xb9e718},{1232,461,0xbce916},}
	aoc['换服']['设置功能选择']={{272,198,0x3bc0ba},{571,198,0x3cc2b9},{891,199,0x3dc1b9},{239,337,0x39bfbc},{248,507,0x26a6be},}
	aoc['换服']['新手界面']={{981,28,0xf6e12a},{760,33,0xe4c690},{354,13,0xeae877},}


aoc['城堡']={}
	aoc['城堡']['在城堡中']={{122,16,0xefed90},{1273,681,0xf5f58e},}
		aoc['城堡']['点击城堡']={ 0xfe6461, "-4|0|0x872927", 90, 574, 75, 849, 234}
		aoc['城堡']['点击城堡2']={ 0xff7773, "-4|4|0xb45148", 90, 558, 72, 889, 273}
		aoc['城堡']['位置固定']={{1194,254,0x34a926},{299,309,0x4eb7ff},}
			aoc['城堡']['资源位置']={{1175,175,0x9a7145},{580,294,0xffcf3d},{319,252,0x1de7f4},}
			aoc['城堡']['木材']={ 0xf8da9c, "-4|6|0xf6ce8d,6|11|0xd8b37f,-6|12|0x1e4249", 90, 1016, 112, 1277, 330}
			aoc['城堡']['金币']={ 0xffff88, "16|17|0xf1ad2e,-9|25|0xffff94,1|19|0xc57c28", 90, 354, 242, 657, 427}
			aoc['城堡']['泉水']={ 0x00e8fa, "-8|-4|0x0e5356,-10|2|0xadffff", 80, 171, 90, 373, 304}

		aoc['城堡']['等待建造中']={ 0xb8ffff, 
			"10|-6|0x1279a1,10|17|0x215b5f,11|28|0xb9ffff,11|31|0x2b656b,22|34|0xc0ffff", 90, 186, 78, 1214, 717}
			
	aoc['城堡']['建筑展开']={{124,15,0xf5f493},{37,27,0xf4f494},}
		aoc['城堡']['新建筑']={ 0xf4d765, "15|2|0x105f2a,18|2|0x008b3e", 90, 0, 551, 1330, 578}
			aoc['城堡']['新仓库']={ 0x4a5e69, "-1|0|0xeeeff0,31|-2|0x485b68,31|-4|0xffffff,39|-6|0x3f5965", 90, 779, 705, 876, 746}
		
		aoc['城堡']['非主城建筑']={ 0x81b6c4, "-58|0|0x528aa3,80|0|0x2c7482", 90, 0, 693, 1328, 705}
		aoc['城堡']['主城建筑']={ 0xffffff, "-9|-2|0x716c59,-30|-2|0xd5c78b", 90, 0, 662, 1333, 720}
		--升级模块
		aoc['城堡']['主城升级提示']={{745,118,0xbaff00},{746,123,0xbaff00},}
		aoc['城堡']['主城升提示']={ 0xbaff00, "-15|0|0xbaff00,-21|0|0xb9ff01,-12|-3|0xbaff00", 90, 580, 90, 889, 145}
		aoc['城堡']['繁荣不足']={ 0xff4b4b, "", 90, 526, 432, 635, 484}
		aoc['城堡']['木材不足']={ 0xff4b4b, "", 90, 755, 432, 863, 478}
		aoc['城堡']['建筑提示']={ 0xf4d765, "11|0|0xf4d765", 90, 471, 51, 818, 213}
		aoc['城堡']['建造']={ 0x29681e, "-3|0|0x51d23e", 90, 469, 395, 943, 548}
		aoc['城堡']['建造资源不足']={ 0xfe4a4b, "", 90, 530, 353, 804, 487}
		aoc['城堡']['主城升级中']={ 0xc8ce94, "0|1|0x8eb285,93|1|0x92af86,98|2|0x418370", 90, 519, 103, 925, 349}
		aoc['城堡']['主城等待中']={ 0x071b1e, "0|1|0xd8c690,0|2|0x8fbf93,45|2|0x8ec097,107|2|0x93c28f", 90, 527, 149,913, 288}
		aoc['城堡']['进入主城']={ 0xf6ffd3, "-20|-28|0x306e20,-20|-31|0xfefefe", 90, 678, 407, 857, 641}
	
		
	aoc['城堡']['成功为会员']={ 0x7aea3f, "-319|-1|0x36bebd,-2|-45|0x32a252", 90, 337, 376, 989, 517}
	aoc['城堡']['邮件提醒']={ 0xc7bf86, "31|-36|0xcb2724", 90, 1248, 635, 1329, 729}
		aoc['城堡']['邮件红点']={ 0xaa093a, "", 90, 1201, 74, 1327, 744}
	aoc['城堡']['商城红点']={{1284,28,0xa05a00},{1318,12,0xe74310},}
	aoc['城堡']['有任务奖励']={{70,678,0xd5ff1a},{102,659,0xc82327},}
	aoc['城堡']['英雄技能']={ 0xfde29c, "1|-12|0xce2c22,15|-13|0xf4d88f", 90, 74, 250, 222, 498}
	aoc['城堡']['技能提示']={{13,371,0x21a995},{21,281,0xd32f21},}
	aoc['城堡']['技能提示_爵位展开']={ 0x25a293, "8|0|0x4ec0b5,8|11|0x3aecbd", 90, 231, 356, 257, 397}
		
	aoc['城堡']['资源合并']={{621,64,0x23887c},{621,61,0x43a197},{632,61,0x4f8e93},}
	aoc['城堡']['资源展开']={ 0xea43d5, "-202|-25|0xb2ffac,-413|-19|0xff3c41", 90, 322, 72, 908, 132}
	
		
aoc['地图']={}
aoc['地图']['金币图']={ 0xeadf70, "-7|16|0xeae776,-1|11|0xc68f34,10|18|0xc19336", 90, 118, 19, 1214, 729}
aoc['地图']['金币图2']={ 0xeae676, "4|0|0xeeeb7a,10|11|0xcf9228,-5|16|0xe9ef84", 90,  118, 19, 1214, 729}
aoc['地图']['金币图3']={ 0xc1e99f, "-7|17|0xbfe69c,9|12|0xb5ac69,10|15|0xafba6a", 90,  118, 19, 1214, 729}--浅蓝
	aoc['地图']['前往']={ 0xffffff, "-30|2|0xffffff,-64|-23|0x42ad74,34|17|0x43d553,30|-23|0x118961", 90, 1, 75, 1332, 747 }
	aoc['地图']['探索']={ 0x5bd740, "-6|-18|0x205e25,-24|-1|0xe9e677,-2|-22|0xffffff", 90, 287, 100, 1120, 647}
aoc['地图']['正在跑路']={ 0x98f4fc, "26|0|0x97e9e9,13|-9|0x6f8eff,13|8|0x6f8eff", 90, 216, 91, 1223, 711}
aoc['地图']['正在跑路小']={ 0x98f5fe, "2|0|0x6f8eff,11|-7|0x6f8eff,10|6|0x6f8eff", 80, 211, 83, 1120, 724}
	aoc['地图']['跑路错误']={ 0xfa0000, "0|3|0xe40000,3|3|0xe40000,-3|3|0xe40000", 90, 292, 113, 1087, 630}
	aoc['地图']['线路错误红色']={ 0xf66666, "22|-1|0xf66666,11|-9|0xf66666,11|-10|0xffc6c6", 90, 376, 187, 1073, 585}
aoc['地图']['城堡定位']={ 0x393a66, 
		"0|-3|0xe7e9f0,-15|12|0x383865,-14|12|0xacb4cb,14|11|0x383e5e,19|11|0xffffff", 90, 1, 2, 1322, 742}
		
aoc['战斗']={}
	aoc['战斗']['箭雨']={ 0xcc6e11, "12|-3|0xfffbd0,21|-6|0xd87c16,30|-6|0xffffd7", 80, 434, 566, 958, 748}
	aoc['战斗']['英勇跳跃']={ 0xd1390c, "39|-42|0xfffff5,39|-15|0xee6a38,43|-10|0xffffdc,40|8|0xdd5a07", 80, 467, 566, 842, 740}
	aoc['战斗']['攻击目标']={ 0xd3111a, "4|0|0xd3111a", 90, 242, 18, 1167, 588}
	aoc['战斗']['取消']={ 0xffffff, "-2|0|0x5d4218,0|-6|0xffffff,0|-15|0xb07326,0|22|0xefc03d", 90, 200, 481, 1300, 596}
	aoc['战斗']['取消2']={ 0x583f20, "0|-2|0x926020,2|6|0xffffff,8|31|0xf4c746,31|18|0x705517", 90, 200, 486, 1300, 588}
	aoc['战斗']['受伤英雄']={ 0xff4b4b, "18|9|0xfd4b4b,31|2|0xff4b4b,-31|-6|0x516373,62|9|0x667d91", 90, 792, 668, 1137, 693}
	aoc['战斗']['可以出战']={ 0x4ec946, "-3|-1|0x276423", 90, 1186, 645, 1295, 705}
	aoc['战斗']['不能战斗']={{1235,709,0x8ba9c5},{1239,707,0x445361},{1242,705,0xffffff},}

aoc['新手']={}
	aoc['新手']['怪红色']={ 0xfd582b, "", 75, 668, 375, 668, 375}
	aoc['新手']['兵绿色']={ 0x68c115, "", 75, 668, 375, 668, 375}

aoc['新手']['战斗界面中']={{39,30,0xf4f494}, {57,23,0xeef191}, }
aoc['新手']['战斗界面中_新手']={{40,32,0xf1f192}, {48,32,0x2db8ab}, {58,25,0xe5df8a}, }

	aoc['新手']['战斗准备']={ 0x00ffea, "52|3|0x1852a3,111|4|0x8f132c,155|-3|0xff6f98", 90, 464, 2, 883, 96}
	aoc['新手']['寻找英雄']={ 0xffde78, "43|8|0xf4c244,12|-19|0xffe177,31|-19|0xf0c844", 90, 120, 8, 1294, 714 } --多点找色
	aoc['新手']['招兵确定']={{694,547,0x4bcfac},{603,513,0x2c9abd},{663,486,0x248eb2},}
	aoc['新手']['战斗胜利']={{883,720,0xaaf74d},{837,701,0x6be041},{825,658,0x3ead56},}
	aoc['新手']['英雄结算画面']={{678,721,0x49ceaf},{627,683,0x2598b9},{761,686,0x1876a4},}
	aoc['新手']['超出队伍']={ 0xff4c4c, "", 90, 1168, 500, 1315, 584}
	aoc['新手']['英雄升级']={{859,652,0xd07024},{961,656,0xd4791b},}
	aoc['新手']['招英雄确定']={{867,658,0x27a5bd},{867,689,0xd1fff6},{869,657,0x12515e},}
	aoc['新手']['招到英雄']={{624,108,0xfefecd},{627,111,0xaf924c},{632,115,0xfefabe},}

	aoc['新手']['任务绿']={ 0xd5ff1f, "-2|12|0xe3ff32", 90, 37, 667, 99, 714}
	aoc['新手']['任务']={{152,19,0xffffff},{153,21,0x0d141d},{191,34,0x0a111b},{193,34,0xffffff},}
		aoc['新手']['领取奖励']={ 0x4ece3f, "-4|0|0x276620,-6|0|0xf1f1f1", 90, 814, 101, 975, 709}
		aoc['新手']['找到目标']={ 0xa0b1aa, "-12|29|0x1f4553,0|9|0xa4b5b4", 80, 832, 105, 1004, 255}
		aoc['新手']['找到目标ios9']={ 0x9bada1, "0|-5|0x94a694,0|6|0xa0b1ab", 80, 832, 105, 1004, 255}
		aoc['新手']['任务激活']={ 0xffffee, "-1|18|0x152836,4|31|0xfefebd", 80, 832, 105, 1004, 255}
		aoc['新手']['任务未激活ios9']={ 0xfafbf3, "1|12|0xffffc7",80, 832, 105, 1004, 255 }
		aoc['新手']['世界地图']={ 0xf1f191, "7|6|0x12424a,-15|-23|0x10575c", 90, 1217, 646, 1326, 744 } --多点找色
			aoc['新手']['前往']={ 0xffffff, "-30|2|0xffffff,-64|-23|0x42ad74,34|17|0x43d553,30|-23|0x118961", 90, 1, 75, 1332, 747 } --多点找色
	aoc['新手']['地图']={ 0xdb0401, "0|5|0xffffff,1|19|0xf9da20", 90, 180, 664, 248, 732}
		aoc['新手']['黄色感叹号']={ 0xfffc0c, "0|13|0x383e5e,0|19|0xfffc0c,1|29|0xffcd07", 90, 283, 67, 1174, 641}
	aoc['新手']['城堡色']={ 0x683a31, "-16|1|0xfa8d5e,-14|-7|0xf78c5e", 90, 331, 178, 936, 527}	
	aoc['新手']['攻击按钮']={  0xe7c538, "-406|-20|0x2ba3c0,-56|-51|0xd25d5c", 90, 353, 515, 983, 615}	
	aoc['新手']['战斗_选择2级兵']={ 0xa88845, "-10|-9|0xa48341,-19|2|0xa88744", 90, 911, 583, 943, 616}


aoc['other']={}
	t['other_网络连接错误']={ 0x007aff, "-49|-10|0x007aff,-44|7|0x007aff,-14|3|0x007aff", 90, 626, 439, 708, 479 } --多点找色
	t['other_连接失败确定']={ 0xffffff, "-123|-5|0xf2f1f6,-130|-12|0xfbfbfb,-150|-36|0x2d97bd,102|25|0x2994bd,219|3|0x47b94e,212|3|0xdfdce2", 90, 337, 410, 991, 533 } --多点找色
	aoc['other']['运送矿点']={{844,497,0x8aef43},{472,492,0x39bebd},}
	aoc['other']['拦劫']={{869,501,0x99f347},{504,493,0x3fc6b6},}
	aoc['other']['成功抢车']={{647,676,0x65df3d},{666,663,0x256520},{567,667,0xe6e4ed},}
	aoc['other']['取消战斗']={{946,533,0x9c1852},{835,593,0xe7c539},{515,592,0x3dc2b8},}
	aoc['other']['直接扫荡']={  0xd7ffff, "10|1|0x000fae,1|9|0x0314ba,37|1|0xffffff", 90, 347, 435, 636, 514}
	aoc['other']['不能直接扫荡_打']={{836,500,0x85ed42},{477,500,0x748da4},{956,221,0x0026ae},}
	aoc['other']['被点确认']={{616,554,0x2dadc1},{628,555,0x3d4362},{631,555,0xffffff},{634,555,0x484e6b},}
	aoc['other']['误攻城堡']={{1274,101,0x0d9639},{1275,80,0xf0e077},{1272,80,0xfefcf2},}
	aoc['other']['公会信息']={{616,75,0xffe200},{652,69,0xffe200},{683,71,0xfde000},{705,70,0xffe200},}
	aoc['other']['误点水泉']={{662,507,0x9af34a},{652,477,0xffffff},}
	aoc['other']['顶号']={{656,464,0xffffff},{667,467,0x26a1bd},}
	aoc['other']['聊天退出']={{29,28,0xe4d38a},{46,10,0xe4d38a},{46,45,0xe4d38a},}
	aoc['other']['暂停界面']={{622,257,0x299dbd},{623,377,0x2aa2bf},{688,526,0x50d3a5},}
	aoc['other']['选择国家界面']={{726,18,0x0a0c10},{726,17,0xffe200},{739,17,0x1a190d},{740,17,0xefd400},}
	aoc['other']['选国界面']={{1051,637,0x259cbc},{1041,637,0xffffff},{1038,637,0x184e5b},
										{1269,609,0x0a6f66},{1270,609,0xcae0df},}
	aoc['国家位置']={{135,247,0x3332ca},{265,176,0x851900},{485,216,0x18e8f0},
					{650,432,0xfcf55f},{316,454,0x7a3bc4},{141,350,0x76c800},}
	--1:深蓝(桑多瑞),2:橙色(葛雷),3:蓝色(利萨姆),4:黄色(达姆斯),5:紫色(莉维塔),6:绿色(夏亚)
	
	aoc['other']['开始旅程']={{936,609,0x7fea42},{1142,64,0xeec900},{1141,64,0x040612},{1135,64,0xffd800},}
	aoc['英雄位置']={{734,238,0x42292a},{944,232,0xc98052},{1171,233,0xf3bdb9},}
	--1:阿瓦隆,2:安德烈,3:爱微儿
	aoc['other']['启动画面']={{1001,273,0xf7ff91},{948,156,0x6b1c18},{143,48,0xda9545},{1089,133,0xdcd1a0},}
	aoc['other']['误打boss']={{1033,565,0x6e3e20},{1030,565,0xd97b40},{724,567,0x28a5bd},}--1,确认,3取消
	
	aoc['other']['预设未展开']={{1131,75,0x163f36}, {1131,78,0xfafbfd}, }
	aoc['other']['预设展开']={{1145,97,0xffffff}, {1145,100,0x26664c}, }
		aoc['other']['可以战斗']={{1240,679,0x52cc44}, {1249,679,0xffffff}, }
		aoc['other']['恢复药']={{825,512,0x5ad83c},{725,512,0xb80003},{504,504,0x14535d},}
		aoc['other']['体力药']={{821,513,0x5cd83d},{725,513,0xfebb0c},{482,502,0x29a5be},}
	aoc['other']['学习技能']={{627,572,0xcc0a00},{623,576,0xffffff},{641,599,0x2b6a1e},}
	aoc['other']['空间已满']={{1137,617,0x3ecc51},{1137,633,0x3ecb49},{1137,686,0x41c94b},}
	aoc['other']['购买物品']={{679,577,0x92f245},{600,527,0xdfea77},}
	aoc['other']['购买3折稀有']={{691,539,0xffffff},{679,550,0x44c740},{604,543,0xf3dd28},{673,571,0x7dea41},}
	aoc['other']['战斗失败']={{845,599,0x85ed42},{490,599,0x40c6ba},{399,568,0xf5f3f5},}
	aoc['other']['死伤较重']={{852,706,0x7eea42},{865,689,0x28681e},{702,138,0xf4eb85},{719,136,0xe92807},}
	aoc['other']['研究会员']={{802,463,0x286c23},{800,463,0x4bca42},{496,463,0x27a6bf},}
	aoc['other']['误加公会']={{787,465,0x25505c},{767,475,0x2da1c0},{492,472,0x27a7be},{502,471,0xffffff},}
	aoc['other']['公会领取成功']={{642,584,0x30b3c3}, {690,595,0x40c4b7}, {664,547,0x228eb3}, }
	
	aoc['other']['触摸魔镜']={ 0x8fef45, "-3|-8|0x3a731f,-21|-46|0x39ad52", 90, 759, 440, 1032, 519}
	aoc['other']['魔镜好东西']={{653,528,0x31b6c0},{568,519,0xe7e2e8},{569,514,0x184560},}
	aoc['other']['得到配方']={{457,605,0x81eb43},{823,608,0x95f146},}
	aoc['other']['宝箱奖励']={{665,544,0x98f447},{577,511,0x45b552},}
	aoc['other']['国家发展宝箱-领取']={{671,565,0xa9f84c},{606,530,0x49c04b},{719,529,0x39bd3e},}
	
	aoc['other']['资源例表']={{709,140,0xf4d765}, {375,298,0xfe4546}, {608,307,0xb8fdb1}, {809,305,0x5e41dc}, }
	aoc['other']['绿色赠品']={{665,510,0x8cef44},{606,483,0x47bf4b},{744,485,0x32b83f},}
	aoc['other']['决战之颠']={{710,692,0x4ace3a},{1091,41,0xd22d0a},{806,45,0xd22d0a},}
	aoc['other']['打开礼物']={ 0xe9e0ef, "-1|-8|0x3b9346,32|0|0x4ac845,159|-21|0x14874b", 90, 690, 621, 897, 678}
	aoc['other']['捡到英雄']={{710,677,0x40c7b9}, {739,656,0x2299bb}, {636,652,0x2c92ba}, }
	
	aoc['other']['遗迹扫荡']={{469,480,0x29a9c1}, {826,501,0x85ec44}, {337,156,0xf2f294}, {334,150,0x0f5a5e}, }
	aoc['other']['遗迹扫荡_无卷']={{846,503,0x90f045}, {491,494,0x70899f}, {333,157,0xebea92}, }
	aoc['other']['战斗失败']={{847,596,0x7ce93f}, {495,598,0x3ec2b9}, {668,142,0x677591}, {662,139,0x828dab}, }
	aoc['other']['领取_']={ 0x8eef45, "-1|-14|0x306e1f", 90, 579, 475, 746, 548}
	aoc['other']['绿色按钮_']={ 0x8cef44, "-9|-49|0x33a752", 90, 535, 486, 811, 606}
	aoc['other']['绿色按钮__']={ 0x88ee41, "-8|-10|0x336f1e", 90, 532, 613, 801, 694}
	aoc['other']['蓝绿按钮_']={ 0x8ff242, "-383|-7|0x39bfbd", 90, 339, 405, 993, 522}
	aoc['other']['蓝绿按钮__']={  0x8ef142, "-417|2|0x47cbb2,1|-58|0x2d9e5c", 90, 333, 635, 1005, 713}
	aoc['other']['蓝绿按钮___']={ 0x90f145, "-411|-24|0x2aa0bf,-30|-48|0x34aa52", 90, 339, 400, 1001, 745}
	aoc['other']['蓝色按钮_']={ 0x3dc3bb, "-62|-25|0x2a9cbd,15|-53|0x1f87b0", 90, 542, 646, 792, 716}
	aoc['other']['蓝色按钮__']={ 0x38bdbd, "-56|-25|0x2a99bc,2|-45|0x248db2", 90, 536, 424, 805, 496}
	aoc['other']['蓝红按钮_']={ 0xe7c539, "-363|-15|0x2dadc1,-8|-55|0xce4f58", 90, 357, 519, 975, 604}
	aoc['other']['蓝红按钮_撤退']={ 0x4bcdb0, "-62|-29|0x2b9fbd,-5|-59|0x218fb5", 90, 539, 504, 799, 579}
	aoc['other']['蓝红按钮_领取成功']={ 0x3dc4ba, "-66|-31|0x2b96ba,-10|-58|0x2194bd", 90, 525, 531, 815, 741}
	aoc['other']['蓝色按钮在中间_']={ 0x3ac2bb, "-59|-21|0x29a1be,-2|-48|0x1e87af", 90, 523, 457, 826, 735}
	aoc['other']['绿色按钮在中间下面_']={ 0x85ec42, "-78|-24|0x47bd4f,-2|-53|0x34a55c", 90, 512, 606, 821, 732}
	--tips
	t['tips_龙巢_巨龙进阶']={ 0xffffff, "-145|-40|0xc64609,46|21|0xd56a10,-114|1|0xdddbe4", 90, 797, 564, 1084, 694 } --多点找色
	t['tips_深渊探险新号点击']={ 0xc8c8c8, "-1|29|0x7d7c7b,141|-2|0x636264,149|10|0x504f51,148|29|0xa4a3a1", 90, 140, 8, 299, 57 } --多点找色
aoc['宝箱']={}
	aoc['宝箱']['未展开']={ 0x20ae95, "-7|0|0x49d0b7,0|2|0x1cb396", 90, 0, 350, 28, 398}
	aoc['宝箱']['展开']={  0x22aa96, "5|0|0x21aa95", 90, 229, 341, 262, 402}
	aoc['宝箱']['宝库']={ 0xfffffe, "5|-1|0xdedd8d,7|33|0x68614b", 90, 10, 265, 188, 337}
	aoc['宝箱']['宝库_无物品']={ 0xffffff, "0|1|0xffffff", 90, 97, 318, 819, 374}
	aoc['宝箱']['开启10次']={ 0x34babd, "-7|14|0x49cdb1,-18|-45|0x248fb4", 90, 998, 187, 1198, 498}
	aoc['宝箱']['开启1次']={ 0x3dc1b9, "10|-22|0xffffff,13|-22|0x104d5c,17|-22|0x219abb", 90, 1009, 104, 1203, 714}
	aoc['宝箱']['领取']={{684,595,0x90f144}, {636,571,0x48c345}, }
	
	aoc['宝箱']['天赋卡使用界面']={{720,171,0xfefefd},{38,28,0x394230},}
		aoc['宝箱']['选择左边英雄']={ 0xe54010, "-6|14|0xaf924c,-13|14|0xcbc899", 90, 63, 392, 1261, 550}
	
aoc['入盟']={}
	aoc['入盟']['聊天选项']={{954,692,0xeeec90},{1085,691,0x104147},{1161,697,0x154c54},{1280,681,0xe2e593},}--排行,联盟,世界,邮件
	aoc['返回']['公会']={{206,34,0xffffff},{206,33,0x181e26},{206,30,0xe7e7e7},{212,34,0xffffff},}
		aoc['返回']['搜索']={{1176,198,0xbcea15},{1181,304,0x518e26},{1184,406,0x529126},}	--2
			aoc['返回']['搜索激活']={{1176,197,0x4e8b26},{1180,301,0xb6e71a},{1179,405,0x4f8b26},}
		
	aoc['入盟']['加入']={{986,209,0x2c9dbd},{629,69,0xffe200},{682,71,0xfde000},{682,73,0x3c2615},}
		aoc['入盟']['改名']={{488,519,0x40c6ba},{811,519,0x89ed42},{631,202,0xffffff},}
		aoc['入盟']['入会成功']={{941,267,0xffecc9},{941,258,0xf47348},{988,244,0xda2e3f},}

aoc['声望']={}
	aoc['声望']['声望界面']={ 0xb41b04, "554|52|0xfacd04,761|-92|0xf2f294", 90, 95, 2, 1332, 268}
		aoc['声望']['未开奖励']={ 0x9f7015, "8|-17|0xff644b,32|-26|0xc21e2b", 90, 191, 587, 1336, 711}
		
--转国临时使用不做更新用
aoc['地图']['侧边']={{10,372,0x20ad96},}
aoc['地图']['王国']={0xf7f79a, "11|-6|0xf7f68f,65|0|0xffffff", 90, 11, 532, 155, 600}
aoc['返回']['转国界面']={{1280,168,0xb6e51b},{1280,268,0x539128},{1278,363,0x548f26},}
		--click(1236,39)--click(1216,443)
--取色列表
aoc['返回']['银翼之国桑多瑞']={{551,24,0x3633c3},{659,61,0x132078},{915,15,0x0b156a},}
aoc['返回']['纯白之帆利萨姆']={{557,33,0x0dffea},{689,25,0xffffff},{686,22,0x003745},}
aoc['地图']['移民按钮']={ 0xffffff, "-2|0|0x134d5c", 90, 827, 277, 946, 341}
--取色列表
aoc['other']['移民按钮']={{824,476,0x2bacbe},{448,473,0x2ba4bf},}

aoc['聊天']={}
	aoc['聊天']['聊天界面']={{29,31,0xe4d38a},{45,16,0xe4d38a},{44,48,0xe4d38a},{1239,28,0x14494d},}
	aoc['聊天']['聊天界面2']={{45,11,0xe4d38a},{45,27,0x14494d},{29,28,0xe4d38a},{40,46,0x14494d},}
	aoc['聊天']['聊天界面_世界频道']={ 0x8dd068, "18|-14|0xffffff,-53|48|0x8dd068,-49|-39|0x8dd068,-9|10|0x8dd068", 90, 6, 74, 151, 645}
	aoc['聊天']['聊天界面_世界频道_界面']={{30,27,0xe4d38a},{683,22,0xffffff},{1259,32,0xe4d38a},}
	aoc['聊天']['聊天界面_世界频道_界面_发言位置']={ 0x14494d, "-14|0|0x14494d,-8|0|0xf9f9f9,22|-1|0xf9f9f9,3|-20|0x14494d", 90, 3, 195, 128, 749}
	aoc['聊天']['聊天界面_世界频道_界面_发送']={ 0xffffff, "-15|-12|0x007aff,10|9|0x007aff", 90, 993, 677, 1183, 740}
	
aoc['回城']={}
	aoc['回城']['回城展开']={ 0x21aa94, "734|291|0xf7f794,835|304|0xf7f693,976|-353|0xab6300", 90, 0, 0, 1333, 749}
	aoc['回城']['回城展开_技能']={ 0x131113, "11|-24|0xf4f593,-15|7|0xcec580,-4|16|0xf2f293,70|-4|0xffffff", 75, 18, 258, 199, 568}
	aoc['回城']['弹窗回城']={ 0xf8fff8, "-30|-80|0xd0b755,-78|-10|0xc3a155,27|-5|0xbb9058,-19|10|0xbbffee", 90, 228, 157, 379, 373}


--弹窗处理-----------
function other()
	yijicw = yijicw or 0
	if d('other_网络连接错误',true)then
	elseif d('other_连接失败确定',true)then
	elseif UI('other','运送矿点',true,1)then
	elseif UI('other','拦劫',true,1)then
	elseif UI('other','成功抢车',true,1)then
		return true
	elseif UI('other','取消战斗',true,3)then
		yijicw = yijicw + 1
		if yijicw%2 == 0 then
			click(560,151,2)		---点击银矿
		end
	elseif UI('other','误打boss',true,3)then
	elseif UI('other','被点确认',true,1)then
	elseif UI('other','误点水泉',true,1)then
	elseif UI('新手','招英雄确定',true,1)then
	elseif UI('other','误攻城堡',false,1)then
		click(40,40)
	elseif UI('other','误加公会',true,3)then
		click(40,40)
		click(h/2,w/2+50)
	elseif UI('other','公会信息',false,1)then
		click(40,40)
	elseif UI('other','顶号',false,1)then
		UI('other','顶号',true,1)
	elseif UI('other','聊天退出',true,1)then
	elseif UI('other','暂停界面',true,2)then
	elseif UI('other','死伤较重',true,1)then
	elseif UI('other','研究会员',true,3)then
	elseif UI('other','购买物品',true,1)then
	elseif UI('other','购买3折稀有',true,1)then
	elseif UI('other','学习技能',true,1)then
		click(40,40)
		click(276,236)
	elseif UI('other','公会领取成功',true,1)then
	elseif UI('other','战斗失败',false,1)then
		zdsb = zdsb or 1
		zdsb = zdsb + 1
		UI('other','战斗失败',true,zdsb%2+1)
	elseif UI('other','遗迹扫荡',true,1)then
		UI('other','遗迹扫荡',true,2)
	elseif UI('新手','英雄升级',true,1)then
	elseif UI('other','遗迹扫荡_无卷',true,1)then
	elseif UI('新手','英雄结算画面',true,1)then
	elseif UI('新手','战斗胜利',true,1)then
	elseif UI_pic('other','触摸魔镜',true,1)then
		delay(1)
		if d('弹窗_魔镜借兵',false,1)then
			click(208,278)
			click(208,278)
			click(208,278)
			d('弹窗_魔镜借兵',true,1)
		end
	elseif UI('other','魔镜好东西',true,1)then
	elseif UI('other','得到配方',true,1)then	
	elseif UI('other','宝箱奖励',true,1)then	
	elseif UI('other','国家发展宝箱-领取',true,1)then
	elseif UI_pic('other','打开礼物',true)then
	elseif UI('other','选择国家界面')then
		if d('龙牙大陆选国界面') then
			龙牙国家选择 = tonumber(UIdata.world)
			click(t['龙牙国家位置'][龙牙国家选择][1],t['龙牙国家位置'][龙牙国家选择][2])
			d('龙牙大陆选国界面_进入',true)
			delay(4)
			click(903,488) ---不在原公会国家点确认 
		elseif UIdata.new then	
			国家选择 = tonumber(UIdata.world)
			click(aoc['国家位置'][国家选择][1],aoc['国家位置'][国家选择][2])
			UI('other','选国界面',true,1)
		end

	elseif UI('other','开始旅程',false,2)then
		英雄选择 = tonumber(UIdata.hero)
		click(aoc['英雄位置'][英雄选择][1],aoc['英雄位置'][英雄选择][2])
		UI('other','开始旅程',true,1)
		delay(8)
	elseif UI('新手','招兵确定',true,1)then
	elseif d('弹窗_魔像弹窗')then
		click(40,40)
	elseif UI('other','绿色赠品',true,1)then
	elseif d('弹窗_报名活动_选择参赛时间',true)then
	elseif UI('other','捡到英雄',true,1)then
	elseif UI_pic('other','领取_',true,1)then
	elseif UI_pic('other','绿色按钮_',true,1)then
	elseif UI_pic('other','绿色按钮__',true,1)then
	elseif UI_pic('other','蓝绿按钮_',true,1)then
	elseif UI_pic('other','蓝绿按钮__',true,1)then
	elseif UI_pic('other','蓝色按钮_',true,1)then
	elseif UI_pic('other','蓝色按钮__',true,1)then
	elseif UI_pic('other','蓝红按钮_撤退',true,1)then
	elseif UI_pic('other','蓝红按钮_领取成功',true,1)then
	elseif UI_pic('other','蓝色按钮在中间_',true,1)then
	elseif UI_pic('other','蓝绿按钮___',true,1)then
	elseif UI_pic('other','绿色按钮在中间下面_',true,1)then
	elseif d('弹窗_双蓝按钮_右左',true,1)then
	elseif d('结算界面_战斗胜利',true,1)then
	elseif d('弹窗_公会技能',true,1)then
	elseif d('tips_龙巢_巨龙进阶',true,1)then
--	elseif d('tips_深渊探险新号点击',true,1)then
	elseif UI_pic('宝箱','展开',true)then
	else
		other_click_mun = other_click_mun  or 1
		other_click_mun = other_click_mun + 1
		if other_click_mun%10 ==0 then
			click(h/2,w/2)
		elseif other_click_mun%2 == 0 then
			click(40,40)
		end
	end
	
end

function awz_re_name(txt)
	reName(getOnlineName()..'/'..txt)
end

aoc['造兵']={}
aoc['造兵']['兵好']={ 0x175c62, "", 90, 1067, 305, 1180, 384}
aoc['造兵']['收兵位置']={
	{ 1085, 313,1153, 370},
	{ 980, 424, 1052, 480},
	{ 847, 491, 918, 545},
	{ 729, 531, 803, 587},
	{ 612, 542, 696, 606}
	}
兵营位置={
	[5]={760,646,0x0e367f},
	[6]={648,666,0x143c6f},
	[7]={883,594,0xa1a8a5},
	[8]={1010,557,0x345e99},
	[9]={1127,426,0x301e13},
	}


aoc['返回']['医院']={{1049,590,0xf1ab35},{669,115,0xf4fff6},}
	aoc['返回']['医院空']={{209,169,0x07182e},{255,172,0x07192e},}
	aoc['返回']['医院满队']={ 0xff4b4b, "", 90, 436, 405, 562, 442}
aoc['返回']['兵营界面']={{1038,601,0xbd7982},{1029,635,0xfcca2b},}	
	aoc['返回']['兵营满队']={ 0xff0000, "", 90, 414, 437, 543, 472}
	aoc['返回']['军队已满']={ 0x21fe9e, "", 90, 446, 377, 869, 437}
	
	aoc['返回']['军队可升级']={ 0xa5c29b, "2|0|0x183211,5|0|0x2b601e", 90, 1119, 349, 1172, 371}
	aoc['返回']['军队升级按钮']={{980,615,0x53db8c},{971,574,0xffffff},{1006,558,0x0c4743},}
	
aoc['返回']['研究院界面']={ 0xfffefe, "47|521|0xfcfdfb,65|-1|0xfffdff", 90, 461, 75, 836, 729 } --多点找色
	aoc['返回']['研究空']={ 0xffffff, "0|-6|0x071e34,-19|39|0xffffff,24|33|0xfafefe", 90, 315, 201, 1237, 372}
	aoc['返回']['研究蓝']={ 0xffffff, "-1|-5|0x0baedf,-27|15|0xfdffff,-19|40|0xffffff", 90, 315, 201, 1237, 372}
	aoc['返回']['研究按钮_研究']={ 0x92f243, "-343|-6|0x3dc4b8,-21|-48|0x31a751", 90, 383, 462, 939, 543}
	aoc['返回']['加入研究院']={{846,532,0x9bf348},{522,526,0x3dc3b9},}
	aoc['返回']['研究完成']={ 0x80ff15, "0|4|0xffff84", 90, 643, 149, 758, 246}

研究院位置 = { 734, 305 }
科技位置={
	[0]={188,401},
	[1]={440,400},
	[2]={686,402},
	[3]={933,406},
	[4]={1178,414},
	[5]={1153,421},
}

aoc['返回']['战争学院界面_选择']={ 0xf4d765, "-616|10|0xf4d765,-810|-454|0xffffff", 90, 103, 4, 1195, 661}
	aoc['返回']['战争学院界面']={ 0xffffff, "130|8|0xffffff,1109|-1|0xf3f392", 90, 106, 0, 1333, 71}
	aoc['other']['战争学院胜利']={{663,710,0x8df043},{567,669,0xf7f7f9},{567,660,0x47ac5f},}
	aoc['返回']['战争攻击']={{1152,677,0xda7e3f},}
	aoc['返回']['战争打完']={{1143,690,0x110c15},{1195,691,0x100d15},}
	aoc['返回']['下一章']={ 0x9b936e, "-19|37|0xdada9c,-20|-39|0x738282", 90, 1262, 300, 1330, 448}
	aoc['other']['战力不足']={{839,473,0x27a8bf},{841,473,0x14535e},{522,481,0x3f6935},{521,481,0xffffff},}
	



--function all()
--	package.loaded['game_ui'] = nil
--	require("game_ui")
--	轮回 = 0

--	function UIinit()
--		UIdata = getTokenUi()
--		if UIdata and UIdata.delivery then
--			dialog("启用token配置",2)
----			log(UIdata)
--		else
----			log('查看手机web设置','all')
--			UIdata = getImeiUi()
--			if UIdata and UIdata.delivery then
--				dialog('启用手机web配置',2)
----				log(UIdata)
--			else
--				UIdata = false
--				dialog('启用手机本地UI配置',2)
--			end
--		end
--		if UIdata then
--			log('格式化web UI')
--			local mainlist ={
--				['0回城']=0,['1换服']=1,['2新手']=2,['3兑券']=3,['4修墙']=4,['5开图']=5,['6暂无']=6,
--				['7主线']=7,['8返击']=8,['9遗迹']=9,['10战争学院']=10,['11清理']=11,['12开龙']=12,['13造兵']=13,['14散兵']=14,['15广告']=15}
--			values.game_main = mainlist[UIdata.game_main]
--			local herolist = {['阿瓦隆']=0,['安德烈']=1,['艾微尔']=2}
--			values.hero = herolist[UIdata.hero]
--			setting = {}
--			for k,v in pairs(UIdata.setting) do
--				local uisetting = split(v,",")
--				setting[tonumber(uisetting[1])] = true
--			end
--			local worldlist = {['桑多瑞']=0,['葛雷']=1,['利萨姆']=2,['达姆斯']=3,['莉维塔']=4,['夏亚']=5}
--			values.world = worldlist[UIdata.world]
--			local kejilist = {['枪']=0,['弓']=1,['剑']=2,['骑']=3,['牧']=4,['车']=5}
--			values.keji_setting=kejilist[UIdata.keji_setting]
--			local yiji_armlist = {['0']=0,['1']=1,['2']=2,['3']=3,['4']=4,['5']=5,['6']=6,['7']=7,['8']=8,['近1']=9,['近2']=10,['全上']=11}
--			values.yiji_arm = yiji_armlist[UIdata.yiji_arm]-1
--			if #UIdata.kuang_setting>0 then
--				kuang_setting = {}
--				for k,v in pairs(UIdata.kuang_setting) do
--					local uisetting = split(v,",")
--					kuang_setting[tonumber(uisetting[1])] = true
--				end
--			end
--			values.xchange = UIdata.xchange
--			values.ad = UIdata.ad
--			log(values)
--		end
--	end

----	Armybuilding()
----	lua_exit() 
--	while (true) do
--		UIinit()
--		主线 = tonumber(values.game_main)
--		log('主线功能->'..主线,true)
		
--		iphonename = getDeviceName()
--		imei = sz.system.serialnumber()
--		if iphonename == "noawz" then
			
--		else
--			imei = sz.system.serialnumber()
--			awz_mun,idfa = getTrueName_awz()
--		end

	
--		if 主线 == 0 then		--创号
--			if backhome()then
--				awz_re_name('回城成功')
--			end
--		elseif 主线 == 1 then		--换服
--			if service()then
--				awz_re_name('换服成功')
--			end
--		elseif 主线 == 2 then		--新手
--			if newplay()then
--				awz_re_name('过完新手')
--			else
--				awz_re_name('过完超时')
--			end
--		elseif 主线 == 3 then		--礼包
--			if gift()then
--				awz_re_name('领券成功')
--			else
--				awz_re_name('领券超时')
--			end
--		elseif 主线 == 4 then		--升城
--			awz_re_name(fixWall())
--		elseif 主线 == 5 then		--开图
--			if map() then
--				awz_re_name('-开地图')
--			else
--				awz_re_name('-开图超时')
--			end
--		elseif 主线 == 6 then		--主线
--			city()
--			auto_get()
--			awz_re_name('主线轮回')
--		elseif 主线 == 7 then		--采矿
--			采矿数量 = 0
--			city()
--			arm()
--			Pantheon()
--			auto_get()
--			awz_re_name('矿('..采矿数量)
--		elseif 主线 == 8 then		--遗迹 
--			if attck()then
--				awz_re_name('成功反击')
--			else
--				awz_re_name('反击超时')
--			end
--		elseif 主线 == 9 then		--遗迹 
--			auto_get()
--		elseif 主线 == 10 then		--劫车
--			战争学院()
--			awz_re_name('战争学院')
--		elseif 主线 == 11 then		--清理
--			清理()
--			dialog('清理完成', 60)
--			lua_exit()
--		elseif 主线 == 12 then		--辅助打野
--			dragon()
--		elseif 主线 == 13 then		--造兵
--			awz_re_name(Armybuilding())
--		elseif 主线 == 14 then		--散兵
--			awz_re_name(dismiss())
--		elseif 主线 == 15 then		--全部
--			if ad()then
--				awz_re_name('广告成功')
--			else
--				awz_re_name('广告超时')
--			end
--		end
	
--		clearOneAccount()
--		if values.oneormore == '1' then
--			log('单机版')
--		else
--			轮回 = 轮回 + 1
--			if setting[5] then
--				repeat
--					delay(2)
--					awz_next()
--					delay(2)
--					awz_mun,idfa = getTrueName_awz()
--					awz_mun_list = strSplit(awz_mun,'/')
--					LastName = awz_mun_list[1]
--				until LastName == 'RecordID:Art of Conquest'
--			else
--				iphonename = getDeviceName()
--				if iphonename == "noawz" then
--					log('next')
--					openURL("IGG://cmd/nextrecord");
--					delay(2)
--				else
--					awz_next()
--				end
--			end
--			toast(轮回,1)
--			delay(2)
			
--		end
--	end
--end












