-----------------------------------------------
------------------ASO V1.0版 ------------------
---------------zhaoty 2016.02.17---------------
-----------------------------------------------
require "TSLib"

--插件调用代码

--os.execute("mkdir /ZTY");
writeFileString("/ZTY/tp001","1206890100","w");--这里设置需要置项的APPID:1190491527，设置完之后，运行此脚本，以“书旗免费小说-免费小说书城阅读器”为例，在APPSTORE中搜索关键词 ”快手漫画“ 排名第一，如果卸载插件，将是2000名之外 
os.execute("chmod  7777  /ZTY");
os.execute("chmod  7777  /ZTY/tp001");
os.execute("chmod  7777  /ZTY/sn");
--runApp("com.apple.AppStore"); --打开APPSTORE页面，需手动搜索“快手漫画”